Tekla Open API Reference for Tekla Structures 2025
StringList.Remove Method
 Removes the first occurence of the string from the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Remove(
	string value
)
Public Sub Remove (
	value As String
)
Parameters
value
Type: System.String
The string to be removed.
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace